[
  {
    "id": "herr_bechler",
    "name": "Herr Bechler",
    "role": "German Teacher",
    "avatar": "/avatars/herr_bechler.png",
    "description": "Herr Bechler is a patient, disciplined and kind German teacher who helps learners master grammar, vocabulary and conversation through clear explanations and gentle, structured guidance.",
    "promptKey": "HERR_BECHLER_PROMPT"
  },
   {
    "id": "dr_chen",
    "name": "Dr. Chen",
    "role": "Nutritionist",
    "avatar": "/avatars/dr_chen.png",
    "description": "Dr. Chen is a knowledgeable, approachable and personalized nutritionist who provides evidence-based dietary advice, meal planning, and lifestyle tips to help individuals achieve their health goals.",
    "promptKey": "DR_CHEN_PROMPT"
  },
  {
    "id": "ms_e_young",
    "name": "Ms. E. Young",
    "role": "Schema Psychotherapist",
    "avatar": "/avatars/ms_e_young.png",
    "description": "Ms. E. Young is a compassionate, patient guide inspired by schema therapy who helps individuals explore their emotional needs, behavioral patterns, and early life experiences through reflective questions and supportive insights.",
    "promptKey": "MS_E_YOUNG_PROMPT"
  },
  
  {
    "id": "mr_freeman",
    "name": "Mr. Freeman",
    "role": "ACT Therapist",
    "avatar": "/avatars/mr_freeman.png",
    "description": "Mr. Freeman is a calm, wise and compassionate ACT-based therapist who helps individuals understand their emotions, accept difficult thoughts, and take meaningful, values-driven action.",
    "promptKey": "MR_FREEMAN_PROMPT"
  },
  {
    "id": "ms_riley",
    "name": "Ms. Riley",
    "role": "Postpartum Consultant",
    "avatar": "/avatars/ms_riley.png",
    "description": "Ms. Riley is a warm, experienced and reassuring postpartum consultant who guides mothers of 3-month-olds through feeding, sleep, and development with practical, compassionate support.",
    "promptKey": "MS_RILEY_PROMPT"
  },
  {
    "id": "mr_williams",
    "name": "Mr. Williams",
    "role": "Career Planner",
    "avatar": "/avatars/mr_williams.png",
    "description": "Mr. Williams is a warm, inspiring and gently humorous career mentor who helps people discover strengths, clarify goals, and build realistic, motivating career roadmaps with optimism.",
    "promptKey": "MR_WILLIAMS_PROMPT"
  },
    {
    "id": "ms_young",
    "name": "Ms. Young",
    "role": "Schema Psychotherapist",
    "avatar": "/avatars/ms_young.png",
    "description": "Ms. Young is a warm, patient, and deeply empathic schema psychotherapist who helps individuals understand their emotional needs, early experiences, and maladaptive patterns using evidence-based schema therapy techniques.",
    "promptKey": "MS_YOUNG_PROMPT"
  }
]